In [2]:
import sqlite3 
import pandas as pd
import os
from collections import Counter

In [13]:
def open_connection_sqlite ():
        """
        Opens and sets sqlite connection
        """
        cwd = os.getcwd() #backend testing
        #cwd = cwd[:cwd.rfind('/')] # go back 1 dir

        db = 'database.sqlite'.format(cwd=cwd)
        try:
            conn_sqlite = sqlite3.connect(db)
            # autocommit
            conn_sqlite.isolation_level = None
            curs_sqlite = conn_sqlite.cursor()
        except sqlite3.Error as err:
            logging.exception('cannot open sqlite connection')
            raise
        return (conn_sqlite, curs_sqlite)

In [14]:
conn_sqlite, curs_sqlite = open_connection_sqlite()

df_station = pd.read_sql_query("SELECT * from station", conn_sqlite)
df_status = pd.read_sql_query("SELECT * from status", conn_sqlite)
df_trip = pd.read_sql_query("SELECT * from trip", conn_sqlite)
df_weather = pd.read_sql_query("SELECT * from weather", conn_sqlite)

In [5]:
df_list = [df_station, df_status, df_trip, df_weather]

In [6]:
df_list[1]

          station_id  bikes_available  docks_available                 time
0                  2                2               25  2013/08/29 12:06:01
1                  2                2               25  2013/08/29 12:07:01
2                  2                2               25  2013/08/29 12:08:01
3                  2                2               25  2013/08/29 12:09:01
4                  2                2               25  2013/08/29 12:10:01
5                  2                2               25  2013/08/29 12:11:01
6                  2                2               25  2013/08/29 12:12:01
7                  2                2               25  2013/08/29 12:13:01
8                  2                2               25  2013/08/29 12:15:01
9                  2                2               25  2013/08/29 12:16:02
10                 2                2               25  2013/08/29 12:18:01
11                 2                2               25  2013/08/29 12:19:01
12                 2                2               25  2013/08/29 12:20:01
13                 2                2               25  2013/08/29 12:21:01
14                 2                2               25  2013/08/29 12:22:01
15                 2                2               25  2013/08/29 12:23:01
16                 2                2               25  2013/08/29 12:25:01
17                 2                2               25  2013/08/29 12:26:01
18                 2                2               25  2013/08/29 12:27:04
19                 2                2               25  2013/08/29 12:29:01
20                 2                2               25  2013/08/29 12:30:01
21                 2                2               25  2013/08/29 12:31:01
22                 2                2               25  2013/08/29 12:32:01
23                 2                2               25  2013/08/29 12:33:01
24                 2                2               25  2013/08/29 12:34:01
25                 2                2               25  2013/08/29 12:36:01
26                 2                2               25  2013/08/29 12:37:01
27                 2                2               25  2013/08/29 12:38:01
28                 2                2               25  2013/08/29 12:39:01
29                 2                2               25  2013/08/29 12:40:02
...              ...              ...              ...                  ...
71984404          84                8                7  2015-08-31 23:30:02
71984405          84                8                7  2015-08-31 23:31:02
71984406          84                8                7  2015-08-31 23:32:02
71984407          84                8                7  2015-08-31 23:33:02
71984408          84                8                7  2015-08-31 23:34:02
71984409          84                8                7  2015-08-31 23:35:02
71984410          84                8                7  2015-08-31 23:36:01
71984411          84                8                7  2015-08-31 23:37:02
71984412          84                8                7  2015-08-31 23:38:02
71984413          84                8                7  2015-08-31 23:39:02
71984414          84                8                7  2015-08-31 23:40:02
71984415          84                8                7  2015-08-31 23:41:02
71984416          84                8                7  2015-08-31 23:42:02
71984417          84                8                7  2015-08-31 23:43:02
71984418          84                8                7  2015-08-31 23:44:02
71984419          84                8                7  2015-08-31 23:45:03
71984420          84                8                7  2015-08-31 23:46:02
71984421          84                8                7  2015-08-31 23:47:03
71984422          84                8                7  2015-08-31 23:48:03
71984423          84                8                7  2015-08-31 23:49:02
71984424          84                8                7  2015-08-31 23:50:02
71984425          84                8                7  2015-08-31 23:51:02
71984426          84                8                7  2015-08-31 23:52:02
71984427          84                8                7  2015-08-31 23:53:03
71984428          84                8                7  2015-08-31 23:54:02
71984429          84                8                7  2015-08-31 23:55:02
71984430          84                8                7  2015-08-31 23:56:01
71984431          84                8                7  2015-08-31 23:57:02
71984432          84                8                7  2015-08-31 23:58:02
71984433          84                8                7  2015-08-31 23:59:02

[71984434 rows x 4 columns]

In [5]:
df_status.shape
#len(df_status.columns)

(71984434, 4)

In [10]:
df_status.head()

   station_id  bikes_available  docks_available                 time
0           2                2               25  2013/08/29 12:06:01
1           2                2               25  2013/08/29 12:07:01
2           2                2               25  2013/08/29 12:08:01
3           2                2               25  2013/08/29 12:09:01
4           2                2               25  2013/08/29 12:10:01

In [6]:
df_trip.shape

(669959, 11)

In [11]:
df_trip.head()
df_trip

,id,duration,start_date,start_station_name,start_station_id,end_date,end_station_name,end_station_id,bike_id,subscription_type,zip_code
0,4069,174,8/29/2013 9:08,2nd at South Park,64,8/29/2013 9:11,2nd at South Park,64,288,Subscriber,94114
1,4073,1067,8/29/2013 9:24,South Van Ness at Market,66,8/29/2013 9:42,San Francisco Caltrain 2 (330 Townsend),69,321,Subscriber,94703
2,4074,1131,8/29/2013 9:24,South Van Ness at Market,66,8/29/2013 9:43,San Francisco Caltrain 2 (330 Townsend),69,317,Subscriber,94115
3,4075,1117,8/29/2013 9:24,South Van Ness at Market,66,8/29/2013 9:43,San Francisco Caltrain 2 (330 Townsend),69,316,Subscriber,94122
4,4076,1118,8/29/2013 9:25,South Van Ness at Market,66,8/29/2013 9:43,San Francisco Caltrain 2 (330 Townsend),69,322,Subscriber,94597

In [45]:
df_weather.shape
df_weather.columns

Index([u'date', u'max_temperature_f', u'mean_temperature_f',
       u'min_temperature_f', u'max_dew_point_f', u'mean_dew_point_f',
       u'min_dew_point_f', u'max_humidity', u'mean_humidity', u'min_humidity',
       u'max_sea_level_pressure_inches', u'mean_sea_level_pressure_inches',
       u'min_sea_level_pressure_inches', u'max_visibility_miles',
       u'mean_visibility_miles', u'min_visibility_miles',
       u'max_wind_Speed_mph', u'mean_wind_speed_mph', u'max_gust_speed_mph',
       u'precipitation_inches', u'cloud_cover', u'events', u'wind_dir_degrees',
       u'zip_code'],
      dtype='object')

In [12]:
df_weather.head()

,date,max_temperature_f,mean_temperature_f,min_temperature_f,max_dew_point_f,mean_dew_point_f,min_dew_point_f,max_humidity,mean_humidity,min_humidity,...,mean_visibility_miles,min_visibility_miles,max_wind_Speed_mph,mean_wind_speed_mph,max_gust_speed_mph,precipitation_inches,cloud_cover,events,wind_dir_degrees,zip_code
0,8/29/2013,74,68,61,61,58,56,93,75,57,...,10,10,23,11,28,0,4,,286,94107
1,8/30/2013,78,69,60,61,58,56,90,70,50,...,10,7,29,13,35,0,2,,291,94107
2,8/31/2013,71,64,57,57,56,54,93,75,57,...,10,10,26,15,31,0,4,,284,94107
3,9/1/2013,74,66,58,60,56,53,87,68,49,...,10,10,25,13,29,0,4,,284,94107
4,9/2/2013,75,69,62,61,60,58,93,77,61,...,10,6,23,12,30,0,6,,277,94107

In [8]:
df_station.shape

(70, 7)

In [13]:
df_station.head()

,id,name,lat,long,dock_count,city,installation_date
0,2,San Jose Diridon Caltrain Station,37.329732,-121.901782,27,San Jose,8/6/2013
1,3,San Jose Civic Center,37.330698,-121.888979,15,San Jose,8/5/2013
2,4,Santa Clara at Almaden,37.333988,-121.894902,11,San Jose,8/6/2013
3,5,Adobe on Almaden,37.331415,-121.893200,19,San Jose,8/5/2013
4,6,San Pedro Square,37.336721,-121.894074,15,San Jose,8/7/2013

In [71]:
df_station['id'].nunique()
df_station.columns[0]

'id'

In [75]:
def df_descriptions (df):
    unique_counts = []
    print len(df.columns)
    for i in range(0, len(df.columns)): 
        # Get unique values of each column 
        print df[df.columns[i]].nunique()
        unique_counts.append(df[df.columns[i]].nunique())
        
        # Get nulls of each column 

df_descriptions(df_status)

4
70
28
28
1047143

In [21]:
def col_descriptions (df, cols):
    """
    Function that takes a pandas dataframe and some of its selected columns and prints out some stats 
    
    Args: 
        pd: pandas dataframe 
        columns: a list of which columns to look at (can only be numerical columns, not categorical)
    Returns:
    
    """
    stats = [[]]
    i = 0 
    for col in cols: 
        print col 
        
        total_rows = len(df)
        #add in number of unique values 
        stats.append(df[col].nunique())
        
        #add in max value of column 
        stats.append(max(df[col]))
        
        #add in minimum value of column 
        stats.append(min(df[col]))
        
        #add in % of 0s 
        zeros = Counter(list(df[col]))[0]
        percent_zeros = zeros*100.00/total_rows
        stats.append(percent_zeros)
        
        #add in % of nulls 
        #nulls can be either a predetermined value or a nicely recognized null value 
        #in numpy and pandas, the recognized null value is NaN. 
        #sometimes, it could just be a '' as well 
        #as of right now, we don't know what's predetermined yet
        #let's take the maximum value of the two 
        
        #regular NaNs 
        #need to first replace blank ones with NaN
        df[col].replace('', np.nan, inplace=True)
        nans = df[col].isnull().sum()
        
    
        percent_nulls = nans*100.00/total_rows 
        stats.append(percent_nulls)
        stats = [[stats]]
        if i > 0: 
            stats.append(stats)
        else:
            stats.append()
        
    final = pd.DataFrame(stats,)

In [29]:
df_status['station_id'].nunique()
df_status['station_id'].isnull().sum()

0

In [22]:
df_status_excl = []
df_status_cols = [column for column in df_status.columns.values if column not in df_status_excl]
col_descriptions (df_status, df_status_cols)

station_id
[70, 84, 2, 0.0, 0.0]
bikes_available
[28, 27, 0, 0.7348866561901425, 0.0]
docks_available
[28, 27, 0, 0.4538189464683434, 0.0]
time
[1047143, u'2015-08-31 23:59:02', u'2013/08/29 12:06:01', 0.0, 0.0]

In [46]:
df_weather_excl = ['zip_code']
df_weather_cols = [column for column in df_weather.columns.values if column not in df_weather_excl]
col_descriptions (df_weather, df_weather_cols)

date
[733, u'9/9/2014', u'1/1/2014', 0.0, 0.0]
max_temperature_f
[56, u'', 44, 0.0, 0.10914051841746249]
mean_temperature_f
[47, u'', 38, 0.0, 0.10914051841746249]
min_temperature_f
[46, u'', 25, 0.0, 0.10914051841746249]
max_dew_point_f
[46, u'', 20, 0.0, 1.4733969986357436]
mean_dew_point_f
[52, u'', 13, 0.0, 1.4733969986357436]
min_dew_point_f
[57, u'', 2, 0.0, 1.4733969986357436]
max_humidity
[61, u'', 24, 0.0, 1.4733969986357436]
mean_humidity
[73, u'', 24, 0.0, 1.4733969986357436]
min_humidity
[78, u'', 4, 0.0, 1.4733969986357436]
max_sea_level_pressure_inches
[83, u'', 29.5, 0.0, 0.027285129604365622]
mean_sea_level_pressure_inches
[81, u'', 29.43, 0.0, 0.027285129604365622]
min_sea_level_pressure_inches
[90, u'', 28.98, 0.0, 0.027285129604365622]
max_visibility_miles
[12, u'', 5, 0.0, 0.35470668485675305]
mean_visibility_miles
[18, u'', 4, 0.0, 0.35470668485675305]
min_visibility_miles
[14, u'', 0, 2.5375170532060025, 0.35470668485675305]
max_wind_Speed_mph
[50, u'', 0, 0.027285129604365622, 0.027285129604365622]
mean_wind_speed_mph
[25, u'', 0, 1.0368349249658937, 0.027285129604365622]
max_gust_speed_mph
[46, u'', 6, 0.0, 24.529331514324692]
precipitation_inches
[86, u'T', 0, 88.15825375170532, 0.027285129604365622]
cloud_cover
[10, u'', 0, 22.755798090040926, 0.027285129604365622]
events
[6, u'rain', u'', 0.0, 85.757162346521142]
wind_dir_degrees
[331, u'', 0, 0.027285129604365622, 0.027285129604365622]

In [3]:
import numpy as np
a = ['a','d']
b = ['1', '']
c = pd.DataFrame({'1': a, '2': b, '3':[np.nan]*2})
#df_weather.isnull().sum()
#df_status.max()
c

   1  2   3
0  a  1 NaN
1  d    NaN

In [11]:
c.replace('', np.nan, inplace=True)
c.isnull().sum()

1    0
2    1
3    2
dtype: int64

In [40]:
a.append(b)

In [43]:
a = [['a', 'd']]
a.append(b)
f = pd.DataFrame(a, columns=['a','a'])

In [44]:
f

   a  a
0  a  d
1  1

In [40]:


c.columns = ['c1', 'c2', 'c3']
c.columns

Index([u'c1', u'c2', u'c3'], dtype='object')

In [41]:
c

  c1 c2  c3
0  a  1 NaN
1  d    NaN

In [52]:
len(c.loc[c['c2']==''])

1